//------------------------------------------------------------------------------------------------------------------------------------------
//1.Заполнить массив А случайными числами (диазпазон на ваше усмотрение). Заменить каждый элемент массива с нечетным индексом на ноль.
//------------------------------------------------------------------------------------------------------------------------------------------


// var arr = [];
// arr.length = 10;
// console.log(arr, 'arrStart')
// for(i = 0; i < arr.length; i+=2){
//     arr[i] = Math.round(Math.random() * 60);
// }
// for(i= 1; i < arr.length; i+=2){
//     arr[i] = 0;
// }
// console.log(arr, 'arrFinish');


//------------------------------------------------------------------------------------------------------------------------------------------
//2.Заполнить массив размерностью n значениями с клавиатуры. Если введенное значение пользователя не число, или отрицательное значение,
// то запросить повторный ввод данных.
//------------------------------------------------------------------------------------------------------------------------------------------


// let a = [];
// p = prompt('длина масива');
// if(isNaN(p) || p<=0){
//     p = prompt('введите не отрицательное число длины масива');
// }
// a.length = p;
// for(let i = 0 ; i<p; i++){
//     a[i] = prompt('содержимое масива');
// }
// console.log(a, 'Масив');
// console.log(a.length, 'Длина масива');


//------------------------------------------------------------------------------------------------------------------------------------------
// 3.Cоздать массив А размерностью n. Заполнить случайными числами любом диапазоне.

// Найти максимальное число и минимальное число.
// Элементы массива между min -- max записать в массив B.
//------------------------------------------------------------------------------------------------------------------------------------------
let a = [];
p = prompt('длина масива');
a.length = p;
for(let i = 0; i < p; i++){
    a[i] = Math.round(Math.random() * 10);
    console.log(a, 'masiv');
}

console.log(p,'long');
let a = [1, 2, 3, 4];
let max = a[0];
let min = a[0];
for(let i = 0 ; i < a.length; i++){
    if(a[i] > max){
        max = a[i];
    } 
    else if(a[i] < min){
        min = a[i];
    }
}

save = min;
min = max;
max = save;

console.log(a, 'massive')
console.log(min, 'min');
console.log(max, 'max');
console.log(save,'save')
let b = [];
for(let j=0; j<a.length; j++){
    if((a[j] != min) && (a[j] != max)){
        console.log(j,'j')
        b[j] = a[j];
    }
}
console.log(b,'b massive')
