
// Реализовать скрипт согласно схеме:
// Блок - схема
 
// Запросить у пользователя число - проверить кратнос ли заданное числу трем; если нет, вывести остаток в консоль.

// Пользователь вводит из три значения, найти какое из них максимальное и вывести его на экран.

// Запросить у пользователя значение, проверить является ли данное значение числом
let admin = "admin";

if(admin == "admin"){
    console.log("Админ")
    
    let pass = "Черный Властелин"
    if(pass == "Черный Властелин"){
    console.log("Добро пожаловать!")
}
    else{
    console.log('неверный пароль')
}   
}
else if(admin != "admin" ){
    console.log("Я вас не знаю")
}
else{
    console.log("Отмена")
}

